In [1]:
# python vs pandas

data = [['Alice', 25 , 'engineer'], ['pk', 30, 'Datascience']]
ages = [row[1] for row in data]
job = [row[2] for row in data]
name = [row[0] for row in data]
print(ages)
print(job)
print(name)

# pandas
import pandas as pd
df = pd.DataFrame(data, columns=['Name', 'Age', 'Program'])
df

[25, 30]
['engineer', 'Datascience']
['Alice', 'pk']

    Name  Age      Program
0  Alice   25     engineer
1     pk   30  Datascience

In [2]:
import pandas as pd
import numpy as np
# Series is one-d labeled array
seris = pd.Series([1,3,5,np.nan, 6, 8])
seris

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# Dataframe is two dimensional array
# DataFrame is like a spreadsheet or SQL table

# dataframe from dictionary

my_data = {
    'Name' : ['Adarsh','Purna','Rajib'],
    'Age' : [22,21,21],
    'City' : ['Tikapur', 'Chisapani', 'Bardiya']
}
df = pd.DataFrame(my_data)
df

     Name  Age       City
0  Adarsh   22    Tikapur
1   Purna   21  Chisapani
2   Rajib   21    Bardiya

In [4]:
# read_csv()
# Data Frame from Csv files
df = pd.read_csv('C:\\Users\\A plus\\Desktop\\1.B.tech\\5th Semester\\Data Science\\DS AI ML\\student.csv')
df

   ID   Name  Age    Program
0   1  Arjun   20  B.Tech CS
1   2   Sita   19     BSc IT
2   3  Niraj   21  B.Tech AI
3   4   Bina   20     BSc CS
4   5  Kiran   22  B.Tech DS

In [5]:
df = pd.read_csv('C:\\Users\\A plus\\Desktop\\1.B.tech\\5th Semester\\Data Science\\DS AI ML\\toyota.csv')
df

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
0,GT86,2016,16000,Manual,24089,Petrol,265,36.2,2.0
1,GT86,2017,15995,Manual,18615,Petrol,145,36.2,2.0
2,GT86,2015,13998,Manual,27469,Petrol,265,36.2,2.0
3,GT86,2017,18998,Manual,14736,Petrol,150,36.2,2.0
4,GT86,2017,17498,Manual,36284,Petrol,145,36.2,2.0
...,...,...,...,...,...,...,...,...,...
6733,IQ,2011,5500,Automatic,30000,Petrol,20,58.9,1.0
6734,Urban Cruiser,2011,4985,Manual,36154,Petrol,125,50.4,1.3
6735,Urban Cruiser,2012,4995,Manual,46000,Diesel,125,57.6,1.4
6736,Urban Cruiser,2011,3995,Manual,60700,Petrol,125,50.4,1.3
6737,Urban Cruiser,2011,4495,Manual,45128,Petrol,125,50.4,1.3

In [6]:
# data frame from Numpy array

import numpy as np
arey = np.random.rand(5,3)
df = pd.DataFrame(arey, columns = ['col1', 'col2', 'Col3'])
df

       col1      col2      Col3
0  0.652661  0.453716  0.068458
1  0.581047  0.348885  0.314049
2  0.861604  0.580435  0.380117
3  0.505753  0.575613  0.949668
4  0.803209  0.914671  0.089567

In [7]:
# dataframe from list of lists
my_data = [['Adarsh',  25], ['pk', 23], ['rajib', 24]]
df = pd.DataFrame(my_data, columns = ['Name', 'Age'])
df

     Name  Age
0  Adarsh   25
1      pk   23
2   rajib   24

## Data Inspection and Exploration
Essential method to understand data

basic Information

df.head() # first 5 rows

df.tail() # last 3 rows

df.inifo() # data types and memory info

df.describe() # statistical summary

# Shapes and Structure
df.shape           # (rows, columns)

df.columns         # Column names

df.dtypes          # Data types per column

df.index           # Row indices

### Data selection and Indexing
### Multiple ways to access data in DataFrame

In [8]:
# Column Selection
# Single Column
df['Name']

0    Adarsh
1        pk
2     rajib
Name: Name, dtype: object

In [9]:
# Multiplpe Column
df[['Name', 'Age']]

     Name  Age
0  Adarsh   25
1      pk   23
2   rajib   24

In [10]:
# Rows Selection
df.iloc[0]    # First row by integfer position
df.loc[0]        # FIrst row by index label
df[0:3]         # Rows o,1,2 (Slicing)

     Name  Age
0  Adarsh   25
1      pk   23
2   rajib   24

In [11]:
# Boolean Indexing (filtering)
df[df['Age'] > 20]
df

     Name  Age
0  Adarsh   25
1      pk   23
2   rajib   24

In [12]:
df[df['Age'] > 21]
df

     Name  Age
0  Adarsh   25
1      pk   23
2   rajib   24

In [13]:
df[df['Name'].str.startswith('A')]

     Name  Age
0  Adarsh   25

In [14]:
df[df['Name'].str.startswith('R')]

Empty DataFrame
Columns: [Name, Age]
Index: []

## Handling Missing Data

 Real-world data often contains missing values

In [15]:
import pandas as pd
df = pd.read_csv('C:\\Users\\A plus\\Desktop\\1.B.tech\\5th Semester\\Data Science\\DS AI ML\\missing_data_sample.csv')
df

    Name   Age Program
0  Arjun  20.0      CS
1   Sita   NaN      IT
2  Niraj  21.0     NaN
3    NaN  19.0      AI
4   Bina   NaN      CS
5  Kiran  22.0     NaN

In [16]:
df.isnull()      # Boolean Dataframe showing missing value

    Name    Age  Program
0  False  False    False
1  False   True    False
2  False  False     True
3   True  False    False
4  False   True    False
5  False  False     True

In [17]:
df.isnull().sum()   # Count of missing values per column

Name       1
Age        2
Program    2
dtype: int64

### handling Strategies 
df.dropna()

df.fillna()

In [18]:
df.dropna()     # Remove rows with missing values

    Name   Age Program
0  Arjun  20.0      CS

In [19]:
df.fillna(0)

    Name   Age Program
0  Arjun  20.0      CS
1   Sita   0.0      IT
2  Niraj  21.0       0
3      0  19.0      AI
4   Bina   0.0      CS
5  Kiran  22.0       0

In [20]:
df.fillna(method='ffill')

C:\Users\A plus\AppData\Local\Temp\ipykernel_5844\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

    Name   Age Program
0  Arjun  20.0      CS
1   Sita  20.0      IT
2  Niraj  21.0      IT
3  Niraj  19.0      AI
4   Bina  19.0      CS
5  Kiran  22.0      CS

In [21]:
df.fillna(df.mean(numeric_only=True))

    Name   Age Program
0  Arjun  20.0      CS
1   Sita  20.5      IT
2  Niraj  21.0     NaN
3    NaN  19.0      AI
4   Bina  20.5      CS
5  Kiran  22.0     NaN

### Data Cleaning and Transformation
fill NaN with mean (or any number) before converting

In [22]:
# Fill missing Age with column mean and convert to int
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Age']

0    20.0
1    20.5
2    21.0
3    19.0
4    20.5
5    22.0
Name: Age, dtype: float64

In [23]:
# Data type Conversion
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Age']

0    20.0
1    20.5
2    21.0
3    19.0
4    20.5
5    22.0
Name: Age, dtype: float64

In [24]:
# Convert Age to int
df['Age'] = df['Age'].astype(int)
df

    Name  Age Program
0  Arjun   20      CS
1   Sita   20      IT
2  Niraj   21     NaN
3    NaN   19      AI
4   Bina   20      CS
5  Kiran   22     NaN

In [25]:
# Create a new data column
df['Date'] = ["2025-01-01", "2025-02-01", "2025-03-01", "2025-04-01", "2025-05-03", "2025-06-06"]
df

    Name  Age Program        Date
0  Arjun   20      CS  2025-01-01
1   Sita   20      IT  2025-02-01
2  Niraj   21     NaN  2025-03-01
3    NaN   19      AI  2025-04-01
4   Bina   20      CS  2025-05-03
5  Kiran   22     NaN  2025-06-06

In [26]:
# convert date to datetime
df['Date'] = pd.to_datetime(df['Date'])
df

    Name  Age Program       Date
0  Arjun   20      CS 2025-01-01
1   Sita   20      IT 2025-02-01
2  Niraj   21     NaN 2025-03-01
3    NaN   19      AI 2025-04-01
4   Bina   20      CS 2025-05-03
5  Kiran   22     NaN 2025-06-06

In [27]:
# String Operation
# Convert Name to uppercase (Handling missing Values)
df['Name'] = df['Name'].str.upper()

# check if program contains 'CS' (example pattern search)
df['IsCS'] = df['Program'].str.contains('CS', na=False)

print(df)

    Name  Age Program       Date   IsCS
0  ARJUN   20      CS 2025-01-01   True
1   SITA   20      IT 2025-02-01  False
2  NIRAJ   21     NaN 2025-03-01  False
3    NaN   19      AI 2025-04-01  False
4   BINA   20      CS 2025-05-03   True
5  KIRAN   22     NaN 2025-06-06  False

In [28]:
# :Removing Duplicates
df.drop_duplicates()
df.drop_duplicates(subset=['Age']) # Remove Duplicates based on column

    Name  Age Program       Date   IsCS
0  ARJUN   20      CS 2025-01-01   True
2  NIRAJ   21     NaN 2025-03-01  False
3    NaN   19      AI 2025-04-01  False
5  KIRAN   22     NaN 2025-06-06  False

In [29]:
# Renaming COlumns:
# df.rename(columns={'Age' : 'new_name'})
df.columns = ['bhyu', 'col2', 'col3', 'col4', 'cpl5']  #Bulk rename
df

    bhyu  col2 col3       col4   cpl5
0  ARJUN    20   CS 2025-01-01   True
1   SITA    20   IT 2025-02-01  False
2  NIRAJ    21  NaN 2025-03-01  False
3    NaN    19   AI 2025-04-01  False
4   BINA    20   CS 2025-05-03   True
5  KIRAN    22  NaN 2025-06-06  False

In [30]:
# Data Aggregation and GroupBy
# The split-apply-combine pattern
import pandas as pd
df = pd.read_csv("C:\\Users\\A plus\\Desktop\\1.B.tech\\5th Semester\\Data Science\\DS AI ML\\EmployeeID.csv")
df

    EmployeeID   Department  Salary  Age Rating
0          101        Sales   60000   35      A
1          102    Marketing   55000   28      B
2          103        Sales   75000   42      A
3          104  Engineering   90000   30      C
4          105    Marketing   62000   31      A
5          106  Engineering  110000   45      B
6          107        Sales   65000   25      B
7          108  Engineering   95000   33      A
8          109    Marketing   58000   29      C
9          110  Engineering  105000   38      A
10         111        Sales   80000   28      B

In [31]:
# Basic Grouping
# Group by department and calculate mean salary
df.groupby('Department')['Salary'].mean()

Department
Engineering    100000.000000
Marketing       58333.333333
Sales           70000.000000
Name: Salary, dtype: float64

In [32]:
# Multiple Aggregations:

df.groupby('Department').agg({
    'Salary': ['mean', 'min', 'max', 'std'],
    'Age' : 'mean'
})

                    Salary                                    Age
                      mean    min     max          std       mean
Department
Engineering  100000.000000  90000  110000  9128.709292  36.500000
Marketing     58333.333333  55000   62000  3511.884584  29.333333
Sales         70000.000000  60000   80000  9128.709292  32.500000

In [33]:
employee_stats = df.groupby('Department').agg({
    'Salary' : 'mean',
    'Age' : ['min', 'max'],
    'EmployeeID' : 'count'
})
print(employee_stats)

                    Salary Age     EmployeeID
                      mean min max      count
Department
Engineering  100000.000000  30  45          4
Marketing     58333.333333  28  31          3
Sales         70000.000000  25  42          4

In [37]:
# Merging and Combining Data
# Concatenation
# Example : split your main data in two smaller DataFrames
df1 = df.iloc[:5] # Start 0 to 5
df2 = df.iloc[5:] #start 5 to end

# Vertical concatenation (stack rows)
vertical_concat = pd.concat([df1, df2])

# Horizontal concatenation (stack columns)
# creating df3 as Dataframe of ratings

df3 = df[['Rating']]
horizontal_concat = pd.concat([df1.reset_index(drop=True), df3.reset_index(drop=True)])

print("\n Horizonatal Concatenation: \n", horizontal_concat)

 Horizonatal Concatenation:
     EmployeeID   Department   Salary   Age Rating
0        101.0        Sales  60000.0  35.0      A
1        102.0    Marketing  55000.0  28.0      B
2        103.0        Sales  75000.0  42.0      A
3        104.0  Engineering  90000.0  30.0      C
4        105.0    Marketing  62000.0  31.0      A
0          NaN          NaN      NaN   NaN      A
1          NaN          NaN      NaN   NaN      B
2          NaN          NaN      NaN   NaN      A
3          NaN          NaN      NaN   NaN      C
4          NaN          NaN      NaN   NaN      A
5          NaN          NaN      NaN   NaN      B
6          NaN          NaN      NaN   NaN      B
7          NaN          NaN      NaN   NaN      A
8          NaN          NaN      NaN   NaN      C
9          NaN          NaN      NaN   NaN      A
10         NaN          NaN      NaN   NaN      B

In [43]:
## Merging (SQL-like joins)
import pandas as pd
# Employee data
df = pd.DataFrame({
'EmployeeID': [101,102,103,104,105,106,107,108,109,110,111],
'Department': ['Sales','Marketing','Sales','Engineering','Marketing','Engineering','Sales','Engineerin','Marketing','Engineering','Sales'],
'Salary': [60000,55000,75000,90000,62000,110000,65000,95000,58000,10500,78888],
'Age': [35,28,42,30,31,45,25,33,29,38,28],
'Rating': ['A','B','A','C','A','B','B','A','C','A','B']
})
# Example: create a separate DataFrame with EmployeeID and some extra info 
bonus_df = pd.DataFrame({
'EmployeeID': [101,103,105,106,108,110],
'Bonus': [5000,7000,6000,10000,8000,9000]
})

# Inner join on EmployeeID
inner_merged = pd.merge(df, bonus_df, on='EmployeeID', how='inner')
print("Inner Join:\n", inner_merged)
# Left join (all employees, add bonus if exists)
left_merged = pd.merge(df, bonus_df, on='EmployeeID', how='left')
print("\nLeft Join:\n", left_merged)
# Full outer join (all employees + all bonus info)
outer_merged = pd.merge(df, bonus_df, on='EmployeeID', how='outer')

Inner Join:
    EmployeeID   Department  Salary  Age Rating  Bonus
0         101        Sales   60000   35      A   5000
1         103        Sales   75000   42      A   7000
2         105    Marketing   62000   31      A   6000
3         106  Engineering  110000   45      B  10000
4         108   Engineerin   95000   33      A   8000
5         110  Engineering   10500   38      A   9000

Left Join:
     EmployeeID   Department  Salary  Age Rating    Bonus
0          101        Sales   60000   35      A   5000.0
1          102    Marketing   55000   28      B      NaN
2          103        Sales   75000   42      A   7000.0
3          104  Engineering   90000   30      C      NaN
4          105    Marketing   62000   31      A   6000.0
5          106  Engineering  110000   45      B  10000.0
6          107        Sales   65000   25      B      NaN
7          108   Engineerin   95000   33      A   8000.0
8          109    Marketing   58000   29      C      NaN
9          110  Engineering   10500   38      A   9000.0
10         111        Sales   78888   28      B      NaN